app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["title", "Test"], ["body", "Hello world!"], ["created_at", 2016-06-28 03:25:09 UTC], ["updated_at", 2016-06-28 03:25:09 UTC]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    # create post then assign owner

    respond_to do |format|
      if @post.save
        format.html { redirect_to user_posts_path(session[:user_id], Post.last), notice: 'Post was successfully created.' }

UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Updated Title"], ["body", "Updated Body"], ["updated_at", 2016-06-28 04:03:51 UTC], ["id", 2]]
---
  def update
    if @post.user == current_user
      respond_to do |format|
        if @post.update(post_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_post
      user = User.find(params[:user_id])
      @post = Post.find(params[:id])