app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Adminnnn"], ["password_digest", "$2a$10$YA1o1sGj6NQv493ARitGCO5j/YvepShFg.Njr0bZmNPFLBgMXYrYW"], ["updated_at", 2016-06-27 07:19:40 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)